api/app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? LIMIT ?  [["authentication_token", "hT15mCg3DjW1KrSWLVqa"], ["LIMIT", 1]]
---
  def valid_token
    @user = User.find_by authentication_token: request.headers["AUTH-TOKEN"]